---
kind: property
id: P:Autodesk.Revit.UI.Events.FormulaEditingEventArgs.Formula
source: html/9a1973a4-204e-92a1-f582-cc0d2be81492.htm
---
# Autodesk.Revit.UI.Events.FormulaEditingEventArgs.Formula Property

Returns text of the formula that will be modified

## Syntax (C#)
```csharp
public string Formula { get; }
```